In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import datetime

In [2]:
path = 'EmployeeAttrition.csv'
df = pd.read_csv(path)
df

,MMM-YY,Emp_ID,Age,Gender,City,Education_Level,Salary,Dateofjoining,LastWorkingDate,Joining Designation,Designation,Total Business Value,Quarterly Rating
0,2016-01-01,1,28,Male,C23,Master,57387,2015-12-24,NaN,1,1,2381060,2
1,2016-02-01,1,28,Male,C23,Master,57387,2015-12-24,NaN,1,1,-665480,2
2,2016-03-01,1,28,Male,C23,Master,57387,2015-12-24,2016-03-11,1,1,0,2
3,2017-11-01,2,31,Male,C7,Master,67016,2017-11-06,NaN,2,2,0,1
4,2017-12-01,2,31,Male,C7,Master,67016,2017-11-06,NaN,2,2,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19099,2017-08-01,2788,30,Male,C27,Master,70254,2017-06-08,NaN,2,2,740280,3
19100,2017-09-01,2788,30,Male,C27,Master,70254,2017-06-08,NaN,2,2,448370,3
19101,2017-10-01,2788,30,Male,C27,Master,70254,2017-06-08,NaN,2,2,0,2
19102,2017-11-01,2788,30,Male,C27,Master,70254,2017-06-08,NaN,2,2,200420,2
19103,2017-12-01,2788,30,Male,C27,Master,70254,2017-06-08,NaN,2,2,411480,2

In [3]:
# Confirm start and end dates of data set. Confirm number of employees.
print(df['Emp_ID'].nunique())
print(df['MMM-YY'].max())
print(df['MMM-YY'].min())

2381
2017-12-01
2016-01-01

In [4]:
# Get start date of each employee
gr_df = df.groupby('Emp_ID')
start_date = gr_df['Dateofjoining'].min()
start_date

Emp_ID
1       2015-12-24
2       2017-11-06
4       2016-12-07
5       2016-01-09
6       2017-07-31
           ...
2784    2012-10-15
2785    2017-08-28
2786    2015-07-31
2787    2015-07-21
2788    2017-06-08
Name: Dateofjoining, Length: 2381, dtype: object

In [5]:
# Confirm where Na values are . .

In [6]:
# Get finish date of each employee. If last day is blank, employee still here (Dec 2017)
att_emp = df.dropna()
len(att_emp)
att_emp = att_emp.reset_index()
att_emp.columns

Index(['index', 'MMM-YY', 'Emp_ID', 'Age', 'Gender', 'City', 'Education_Level',
       'Salary', 'Dateofjoining', 'LastWorkingDate', 'Joining Designation',
       'Designation', 'Total Business Value', 'Quarterly Rating'],
      dtype='object')

In [7]:
ae_se = att_emp[['Emp_ID','LastWorkingDate']]
ae_se

      Emp_ID LastWorkingDate
0          1      2016-03-11
1          4      2017-04-27
2          5      2016-03-07
3          8      2017-11-15
4         12      2016-12-21
...      ...             ...
1611    2779      2017-02-14
1612    2782      2016-08-16
1613    2785      2017-10-28
1614    2786      2016-09-22
1615    2787      2016-06-20

[1616 rows x 2 columns]

In [8]:
# create new df to store information
# add employee name, columns for start date, finish date & tenure
new_df = pd.DataFrame(start_date)

new_df = new_df.reset_index()
new_df = pd.merge(new_df, ae_se, how='left', on=['Emp_ID'])
new_df['Tenure']=""
new_df

      Emp_ID Dateofjoining LastWorkingDate Tenure
0          1    2015-12-24      2016-03-11
1          2    2017-11-06             NaN
2          4    2016-12-07      2017-04-27
3          5    2016-01-09      2016-03-07
4          6    2017-07-31             NaN
...      ...           ...             ...    ...
2376    2784    2012-10-15             NaN
2377    2785    2017-08-28      2017-10-28
2378    2786    2015-07-31      2016-09-22
2379    2787    2015-07-21      2016-06-20
2380    2788    2017-06-08             NaN

[2381 rows x 4 columns]

In [9]:
# Formula to calculate Tenure
# new_df['Current_Status'] = ''
# new_df['Current_status'] = new_df['Current_status'].fillna(1)


new_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2381 entries, 0 to 2380
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Emp_ID           2381 non-null   int64
 1   Dateofjoining    2381 non-null   object
 2   LastWorkingDate  1616 non-null   object
 3   Tenure           2381 non-null   object
dtypes: int64(1), object(3)
memory usage: 93.0+ KB

In [10]:
# If LastWorkingDate ==Nan current_status == 1
# else current
new_df['Current_Status'] = new_df.loc[new_df['LastWorkingDate'] != 'NaN', 'Current_Status']=2

new_df['LastWorkingDate'].value_counts()

2017-07-29    70
2016-09-22    26
2016-03-17    14
2017-11-28    13
2017-02-17    13
              ..
2016-12-27     1
2016-04-15     1
2016-08-17     1
2016-08-19     1
2016-04-06     1
Name: LastWorkingDate, Length: 493, dtype: int64

In [11]:
# Display whether employees have left the company with boolean values. (I couldn't work out the current status column)
test_status = pd.notnull(new_df['LastWorkingDate'])
new_df['Left_Company'] = test_status
new_df

,Emp_ID,Dateofjoining,LastWorkingDate,Tenure,Current_Status,Left_Company
0,1,2015-12-24,2016-03-11,,2,True
1,2,2017-11-06,NaN,,2,False
2,4,2016-12-07,2017-04-27,,2,True
3,5,2016-01-09,2016-03-07,,2,True
4,6,2017-07-31,NaN,,2,False
...,...,...,...,...,...,...
2376,2784,2012-10-15,NaN,,2,False
2377,2785,2017-08-28,2017-10-28,,2,True
2378,2786,2015-07-31,2016-09-22,,2,True
2379,2787,2015-07-21,2016-06-20,,2,True
2380,2788,2017-06-08,NaN,,2,False

In [12]:
# convert dates to datetime data type & save as series
start_date = pd.to_datetime(new_df['Dateofjoining'],yearfirst=True, errors='ignore')
start_date

0      2015-12-24
1      2017-11-06
2      2016-12-07
3      2016-01-09
4      2017-07-31
          ...
2376   2012-10-15
2377   2017-08-28
2378   2015-07-31
2379   2015-07-21
2380   2017-06-08
Name: Dateofjoining, Length: 2381, dtype: datetime64[ns]

In [13]:
# convert dates to datetime data type & save as series
end_date = pd.to_datetime(new_df['LastWorkingDate'],yearfirst=True, errors='ignore')
end_date

0      2016-03-11
1             NaT
2      2017-04-27
3      2016-03-07
4             NaT
          ...
2376          NaT
2377   2017-10-28
2378   2016-09-22
2379   2016-06-20
2380          NaT
Name: LastWorkingDate, Length: 2381, dtype: datetime64[ns]

In [19]:
# Add datetime series to dataframe. Replace null values with 31-Dec-2017
new_df['Start_date']= start_date
new_df['End_date']= end_date
latest_date = pd.to_datetime('2017-12-31')
new_df['End_date'] = new_df['End_date'].fillna(latest_date)
new_df

,Emp_ID,Dateofjoining,LastWorkingDate,Tenure,Current_Status,Left_Company,Start_date,End_date
0,1,2015-12-24,2016-03-11,78.0,2,True,2015-12-24,2016-03-11
1,2,2017-11-06,NaN,NaN,2,False,2017-11-06,2017-12-31
2,4,2016-12-07,2017-04-27,141.0,2,True,2016-12-07,2017-04-27
3,5,2016-01-09,2016-03-07,58.0,2,True,2016-01-09,2016-03-07
4,6,2017-07-31,NaN,NaN,2,False,2017-07-31,2017-12-31
...,...,...,...,...,...,...,...,...
2376,2784,2012-10-15,NaN,NaN,2,False,2012-10-15,2017-12-31
2377,2785,2017-08-28,2017-10-28,61.0,2,True,2017-08-28,2017-10-28
2378,2786,2015-07-31,2016-09-22,419.0,2,True,2015-07-31,2016-09-22
2379,2787,2015-07-21,2016-06-20,335.0,2,True,2015-07-21,2016-06-20
2380,2788,2017-06-08,NaN,NaN,2,False,2017-06-08,2017-12-31

In [ ]:
# new_df.loc[new_df['LastWorkingDate']==Nan,'Current_Status']=1

In [20]:
# Formula for tenure in number of days
new_df['Tenure'] = ((new_df.End_date - new_df.Start_date)/np.timedelta64(1,'D'))
try:
    new_df['Tenure'] = new_df['Tenure'].astype(int)
except (ValueError):
    pass
new_df

,Emp_ID,Dateofjoining,LastWorkingDate,Tenure,Current_Status,Left_Company,Start_date,End_date
0,1,2015-12-24,2016-03-11,78,2,True,2015-12-24,2016-03-11
1,2,2017-11-06,NaN,55,2,False,2017-11-06,2017-12-31
2,4,2016-12-07,2017-04-27,141,2,True,2016-12-07,2017-04-27
3,5,2016-01-09,2016-03-07,58,2,True,2016-01-09,2016-03-07
4,6,2017-07-31,NaN,153,2,False,2017-07-31,2017-12-31
...,...,...,...,...,...,...,...,...
2376,2784,2012-10-15,NaN,1903,2,False,2012-10-15,2017-12-31
2377,2785,2017-08-28,2017-10-28,61,2,True,2017-08-28,2017-10-28
2378,2786,2015-07-31,2016-09-22,419,2,True,2015-07-31,2016-09-22
2379,2787,2015-07-21,2016-06-20,335,2,True,2015-07-21,2016-06-20
2380,2788,2017-06-08,NaN,206,2,False,2017-06-08,2017-12-31

In [26]:
aver_tenure = new_df['Tenure'].mean()

med_tenure = new_df['Tenure'].median()
print(aver_tenure,med_tenure)

437.11717765644687 192.0

In [24]:
term_df = new_df.loc[new_df['Left_Company']== True,:]
term_df

,Emp_ID,Dateofjoining,LastWorkingDate,Tenure,Current_Status,Left_Company,Start_date,End_date
0,1,2015-12-24,2016-03-11,78,2,True,2015-12-24,2016-03-11
2,4,2016-12-07,2017-04-27,141,2,True,2016-12-07,2017-04-27
3,5,2016-01-09,2016-03-07,58,2,True,2016-01-09,2016-03-07
5,8,2017-09-19,2017-11-15,57,2,True,2017-09-19,2017-11-15
7,12,2016-06-29,2016-12-21,175,2,True,2016-06-29,2016-12-21
...,...,...,...,...,...,...,...,...
2373,2779,2017-01-26,2017-02-14,19,2,True,2017-01-26,2017-02-14
2375,2782,2016-05-16,2016-08-16,92,2,True,2016-05-16,2016-08-16
2377,2785,2017-08-28,2017-10-28,61,2,True,2017-08-28,2017-10-28
2378,2786,2015-07-31,2016-09-22,419,2,True,2015-07-31,2016-09-22
2379,2787,2015-07-21,2016-06-20,335,2,True,2015-07-21,2016-06-20

In [25]:
current_df = new_df.loc[new_df['Left_Company']== False,:]
current_df

,Emp_ID,Dateofjoining,LastWorkingDate,Tenure,Current_Status,Left_Company,Start_date,End_date
1,2,2017-11-06,NaN,55,2,False,2017-11-06,2017-12-31
4,6,2017-07-31,NaN,153,2,False,2017-07-31,2017-12-31
6,11,2017-12-07,NaN,24,2,False,2017-12-07,2017-12-31
9,14,2017-10-16,NaN,76,2,False,2017-10-16,2017-12-31
17,25,2014-10-30,NaN,1158,2,False,2014-10-30,2017-12-31
...,...,...,...,...,...,...,...,...
2370,2775,2017-10-02,NaN,90,2,False,2017-10-02,2017-12-31
2372,2778,2017-11-29,NaN,32,2,False,2017-11-29,2017-12-31
2374,2781,2017-02-17,NaN,317,2,False,2017-02-17,2017-12-31
2376,2784,2012-10-15,NaN,1903,2,False,2012-10-15,2017-12-31
2380,2788,2017-06-08,NaN,206,2,False,2017-06-08,2017-12-31

In [32]:
term_list = []
current_list = []
all_list = []
term_list.append(term_df['Tenure'].mean())
term_list.append(term_df['Tenure'].median())
current_list.append(current_df['Tenure'].mean())
current_list.append(current_df['Tenure'].median())
all_list.append(new_df['Tenure'].mean())
all_list.append(new_df['Tenure'].median())

summary_df = pd.DataFrame({'Past Employees':term_list,\
                           'Current Employees':current_list,\
                            'All Employees':all_list},
                            index=['Mean Tenure (days)','Median Tenure (days)'])
summary_df

                      Past Employees  Current Employees  All Employees
Mean Tenure (days)        357.715347         604.847059     437.117178
Median Tenure (days)      176.000000         242.000000     192.000000